# 某公司采用公共电话传递数据,数据是由4位的整数,再传递的过程中是加密的,加密的规则如下:每位数字都加上 5 ,然后用和除以 10 的取余数代替该数字,
# 第一位和第四位互换,第二位和第三位互换,
# 请输入任意的四位数,输出其加密后的数字
a = input('请输入一个四位的数字: ')
try:
    if len(a) == 4:
        a = int(a)
        i = (a % 10 + 5) % 10  # 个位
        j = (a // 10 % 10 + 5) % 10  # 十位
        q = (a // 100 % 10 + 5) % 10  # 百位
        w = (a // 1000 % 10 + 5) % 10  # 千位
        my_list = []
        my_list.extend([i, j, q, w])
        for num in my_list:
            print(num, end='')
    else:
        print('请正确输入一个4位数字')
except ValueError as f:
    print('你输入的是字符,不是4位数字,请重新输入 ')
    print(f)   # 打印字符异常信息





